{
    "version": "https://jsonfeed.org/version/1",
    "title": "Islandora 8 Overview",
    "description": "",
    "home_page_url": "https://donrichards.github.io/migrate_islandora_csv",
    "feed_url": "https://donrichards.github.io/migrate_islandora_csv/feed.json",
    "user_comment": "",
    "icon": "https://donrichards.github.io/migrate_islandora_csv/media/website/8.png",
    "author": {
        "name": "Don Richards"
    },
    "items": [
        {
            "id": "https://donrichards.github.io/migrate_islandora_csv/content-modeling.html",
            "url": "https://donrichards.github.io/migrate_islandora_csv/content-modeling.html",
            "title": "CONTENT MODELING",
            "summary": "Islandora 8 compartmentalized content model behaviors by opting for a mix of microservices, context, and action solutions. Islandora objects are referred to as nodes. A node’s type is called a resource model. The resource models include (but are not limited to) audio, binary, collections, digital&hellip;",
            "content_html": "<p>Islandora 8 compartmentalized content model behaviors by opting for a mix of microservices, context, and action solutions. Islandora objects are referred to as nodes. A node’s type is called a resource model. The resource models include (but are not limited to) audio, binary, collections, digital documents, images, pages, paged content, publication issue, and videos. In Islandora 7, content models refer to how derivatives are generated and how the object is displayed, however in Islandora 8 this concept doesn’t fit the behavior completely. When a model tag is applied to an object/node, this indicates to Drupal which context(s) to use resulting in corresponding actions to be fired. generating appropriate derivatives, resource mapping, and specifying an appropriate default viewer.</p>\n<p>“Islandora 8 Data Model. Between the original capabilities of Drupal 8, the wealth of available modules, and the work that has already been done with Islandora 8, nearly any standard Islandora 7 content model can be represented in Islandora 8 from the simple (binary, PDF, image, audio, video) to the complex (compounds, books, newspapers). This is all done via the Repository Item content model which contains nearly all of the fields necessary to describe any type of object, and is the core of most of Islandora 8’s Drupal features. Many Drupal views and contexts can be triggered by targeting one or more of the fields in a Repository Item node in a way that makes requiring separate content types unnecessary. Examples include changing the template for displaying a node based on what “type” it is, or changing the viewer that is used based on the type of file a node has.” [<a href=\"https://docs.google.com/document/d/11Y7kGyVlrRW3uIqFPzMgQ2nj3gzB3U2FEO75X2n3bo8\">link</a>]</p>\n<ul>\n<li>An object is a <em>node</em> (a.k.a. <em>content</em>).</li>\n<li>Nodes have properties that can be configured called <em>fields</em>.</li>\n<li>Fields for nodes are grouped together as <em>content types</em>.</li>\n<li>Datastreams are <em>media</em>, which are <em>files</em> that can have their own fields and <em>media types</em>.</li>\n<li>Metadata used to categorize entities are <em>taxonomy terms</em>, which also have their own fields and <em>vocabularies</em>. They can represent everything from simple labels to more complex concepts such as people, places, and subjects.</li>\n</ul>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://user-images.githubusercontent.com/2738244/85067990-952def80-b17f-11ea-810f-fc8c0b59e90b.png\" data-is-external-image=\"true\"  alt=\"diagram\" /></figure></p>\n",
            "image": "https://donrichards.github.io/migrate_islandora_csv/media/posts/3/diagram.png",
            "author": {
                "name": "Don Richards"
            },
            "tags": [
                   "modeling",
                   "microservice",
                   "content modeling"
            ],
            "date_published": "2020-06-19T09:14:36-04:00",
            "date_modified": "2020-06-19T09:14:36-04:00"
        },
        {
            "id": "https://donrichards.github.io/migrate_islandora_csv/background.html",
            "url": "https://donrichards.github.io/migrate_islandora_csv/background.html",
            "title": "Background",
            "summary": "Islandora 7 is a monolithic application that glues Drupal 6/7 to Fedora 3 with an optional institutional repository (IR) addon. Islandora 7 had several pain points, such as workflows, most of which required substantial coding to work around these issues. Although Islandora is a collection&hellip;",
            "content_html": "<p>Islandora 7 is a monolithic application that glues Drupal 6/7 to Fedora 3 with an optional institutional repository (IR) addon. Islandora 7 had several pain points, such as workflows, most of which required substantial coding to work around these issues. Although Islandora is  a collection of several Drupal 6/7 modules, it wasn’t written in a way that leveraged much of Drupal’s content management functionality. Fortunately for 8 this has been remedied.</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://user-images.githubusercontent.com/2738244/85065965-0cfa1b00-b17c-11ea-83c6-cb08ebd23ff9.png\" data-is-external-image=\"true\"  alt=\"I8\" /></figure></p>\n<p>The Drupal 8 release in 2015 had a major overhaul of the code base. This meant that upgrading from Drupal 7 into Drupal 8 broke content libraries, functions, and theming. Drupal 8’s migration is an Extract, Transform, Load (ETL) process as part of its Migrate API. The data can come from a variety of places; a database, CSV, JSON, or REST function, and then transformed, imported, and processed (Migrate API overview, 2019).</p>\n<p>Future upgrades of Drupal versions will look substantially different than before. Gone are the days of major migration planning as Drupal has completely overhauled their application lifecycle. With Drupal 9 being released in June 2020 the process of upgrading won’t cause any loss in functionality or any libraries to break; the core is completely backwards compatible. This important feature was adopted  for the new life cycle for all future version releases. It was explained simply by Alex Lopez, “You’ll just get notices advising you to upgrade libraries, function calls, and anything else in your code that would make your module incompatible with a Drupal 10 version. But, theoretically, nothing that would break your module/site.”(2018). A large focus of Drupal core and module development for the 8 release was on specific industries, including but not limited to big data and higher education. “Build a wide range of solutions from university websites, applications, scholarly publishing, and more.” (Drupal for education, 2020).</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://user-images.githubusercontent.com/2738244/85065822-db814f80-b17b-11ea-8eb5-4ee294bae8fb.jpg\" data-is-external-image=\"true\"  alt=\"background\" /></figure></p>\n<p>Islandora changed the development approach to align with Drupal 8’s direction. A major focus on Islandora 8 is to build the stack in a way that fully utilizes Drupal 8 and make the contributed modules available. There are so many modules currently  developed and actively managed by other institutions that provide content modeling  and developing metadata has become exceedingly easier. As the need for IRs increases, the number of options available have increased as well making it sometimes difficult to sift through to find the best option for the community. Since these are so new, many of these lack sufficient documentation or guidance on how to best utilize the modules for a digital or institutional repository. The Islandora community makes every effort to bring content models together by research, community vetting, writing documentation, and creating solutions to help provide a ready made (turn key) solution.Islandora 8 content is now utilizing Drupal nodes as the primary representation instead of how Islandora 7 overwrote Drupal routing to provide an object and it’s content. Islandora 8 content is Drupal content (stored in Fedora 5) and is completely compatible with 3rd party addons.</p>\n",
            "image": "https://donrichards.github.io/migrate_islandora_csv/media/posts/2/background.jpg",
            "author": {
                "name": "Don Richards"
            },
            "tags": [
                   "history",
                   "Drupal 8 ",
                   "Background"
            ],
            "date_published": "2020-06-19T09:14:36-04:00",
            "date_modified": "2020-06-19T09:14:36-04:00"
        },
        {
            "id": "https://donrichards.github.io/migrate_islandora_csv/islandora-8-overview.html",
            "url": "https://donrichards.github.io/migrate_islandora_csv/islandora-8-overview.html",
            "title": "Islandora 8 Overview",
            "summary": "There are over 300 universities running Islandora according to the latest survey with 4 currently running Islandora 8 in production with several in beta. These numbers do not include government or private instances which commonly don’t report or aren’t publicly accessible like UTK’s TRACE. Here’s&hellip;",
            "content_html": "<p>There are over 300 universities running Islandora according to the latest survey with 4 currently running Islandora 8 in production with several in beta. These numbers do not include government or private instances which commonly don’t report or aren’t publicly accessible like UTK’s <a href=\"https://trace.utk.edu\">TRACE</a>. </p>\n<h1 id=\"quick-summary\">Quick Summary</h1>\n<p>Here’s a list of all the Islandora features currently available with the 1.1.0 release (including those that come for free from contributed modules):</p>\n<ul>\n<li>Model content using core Drupal entities and fields</li>\n<li>Out of the box support for<ul>\n<li>Collections</li>\n<li>Images</li>\n<li>Books</li>\n<li>Newspapers</li>\n<li>Audio</li>\n<li>Video</li>\n<li>PDF</li>\n<li>Binaries</li>\n</ul>\n</li>\n<li>Control how content is displayed using the UI</li>\n<li>Configure forms for content using the UI</li>\n<li>Categorize content using taxonomy terms</li>\n<li>Expandable file storage<ul>\n<li>Drupal’s public file system</li>\n<li>Multiple private file systems using <a href=\"https://www.drupal.org/project/flysystem\">flysystem</a> (check this link for a full list of supported adapters)<ul>\n<li>Fedora</li>\n<li>Local or networked storage</li>\n<li>Sftp</li>\n<li>AWS S3</li>\n<li>and more…</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>REST API<ul>\n<li>Basic CRUD operations with Drupal REST and JSON</li>\n<li>Read-only JSONLD serialization</li>\n<li>Extensive use of Link headers for discoverability</li>\n<li>Add files to objects with PUT</li>\n</ul>\n</li>\n<li>Solr search (<a href=\"https://www.drupal.org/project/search_api_solr\">using search_api_solr</a>)<ul>\n<li>Configure search index through the UI</li>\n</ul>\n</li>\n<li>Custom viewers<ul>\n<li>Openseadragon</li>\n<li>PDF.js using the <a href=\"https://www.drupal.org/project/pdf\">pdf</a> module</li>\n</ul>\n</li>\n<li>Custom field types<ul>\n<li>Extended Date Time Format (EDTF)</li>\n<li>Typed Relation</li>\n<li>Authority Link</li>\n</ul>\n</li>\n<li>Custom entities for:<ul>\n<li>People</li>\n<li>Families</li>\n<li>Organizations</li>\n<li>Locations</li>\n<li>Subjects</li>\n</ul>\n</li>\n<li>Derivatives<ul>\n<li>Convert / transform images (or just use<a href=\"https://www.drupal.org/docs/user_guide/en/structure-image-style-create.html\"> Drupal image styles</a>!)</li>\n<li>Extract images from PDFs</li>\n<li>Extract images from Video</li>\n<li>Convert audio formats</li>\n<li>Convert video formats</li>\n<li>All derivative operations have forms and can be configured through the UI</li>\n</ul>\n</li>\n<li>Access control<ul>\n<li>Hide content from users and search with the <a href=\"https://www.drupal.org/project/permissions_by_term\">permissions_by_term</a> module</li>\n<li>Hide sensitive fields from users using the <a href=\"https://www.drupal.org/project/field_permissions\">field_permissions</a> module</li>\n</ul>\n</li>\n<li>Control repository events through the UI using the<a href=\"https://www.drupal.org/project/context\"> context</a> module<ul>\n<li>Index RDF in Fedora</li>\n<li>Index RDF in a Triplestore</li>\n<li>Derivatives</li>\n<li>Switching themes</li>\n<li>Switching displays/viewers</li>\n<li>Switching forms</li>\n<li>And much much more….</li>\n</ul>\n</li>\n<li>Multi-lingual support<ul>\n<li>Translated content is included in metadata and indexed in both Fedora and the Triplestore with proper language tags</li>\n<li>The user interface can be translated to languages other than English</li>\n</ul>\n</li>\n<li>Bulk ingest using CSVs<ul>\n<li>See the<a href=\"https://github.com/Islandora-CLAW/migrate_islandora_csv\"> islandora_migrate_csv</a> module for a detailed tutorial</li>\n</ul>\n</li>\n<li><a href=\"https://www.drupal.org/docs/user_guide/en/views-concept.html\">Views</a>! You can filter, sort, display, and otherwise manipulate lists of content in all kinds of ways. For example:<ul>\n<li>Make a browse by collections page (see <a href=\"http://future.islandora.ca/collections\">this example</a> on the sandbox, which can be customized <a href=\"http://future.islandora.ca/admin/structure/views/view/islandora_content/edit/page_1?destination=/collections\">here</a>).</li>\n<li>Make an image gallery (see <a href=\"http://future.islandora.ca/node/7\">this example</a> on the sandbox, which can be customized <a href=\"http://future.islandora.ca/admin/structure/views/view/sandbox_members_image_gallery/edit/block_1?destination=/node/7\">here</a>)</li>\n<li>Make a slideshow (see <a href=\"http://future.islandora.ca/\">this example</a> on the sandbox, which can be customized <a href=\"http://future.islandora.ca/admin/structure/views/view/sandbox_slideshow/edit/block_1?destination=/node/6\">here</a>) using <a href=\"https://www.drupal.org/project/views_slideshow\">views_slideshow</a>.</li>\n<li>Put pins on a Google map using the <a href=\"https://www.drupal.org/project/geolocation\">geolocation</a> module</li>\n<li>Execute actions in bulk on views results using the <a href=\"https://www.drupal.org/project/views_bulk_operations\">views_bulk_operations</a> module<ul>\n<li>Re-index content</li>\n<li>Re-generate derivatives</li>\n<li>And everything else you can do with Drupal actions (pretty much anything!)</li>\n</ul>\n</li>\n<li>Bulk edit metadata using <a href=\"https://www.drupal.org/project/views_bulk_edit\">views_bulk_edit</a> (see <a href=\"http://future.islandora.ca/islandora-batch-edit\">this example</a> on the sandbox, which can be customized <a href=\"http://future.islandora.ca/admin/structure/views/view/islandora_batch_edit/edit/page_1?destination=/islandora-batch-edit\">here</a>)</li>\n</ul>\n</li>\n<li>Paged Content<ul>\n<li>Order sequences of content using a weight field</li>\n<li>Generate IIIF manifests for presenting paged content</li>\n<li>View paged content with the Openseadragon viewer</li>\n</ul>\n</li>\n<li>Extracted Text<ul>\n<li>Extract text from both TIFFs and PDFs</li>\n<li>Extracted text can be indexed in Solr</li>\n</ul>\n</li>\n<li>FITS Derivatives<ul>\n<li>FITS XML is generated for new file uploads</li>\n</ul>\n</li>\n<li>Versioning<ul>\n<li>Drupal revisions create Memento versions in Fedora</li>\n</ul>\n</li>\n<li>OAI-PMH Endpoint<ul>\n<li>Configurable using views</li>\n</ul>\n</li>\n<li>Better Search / Discovery<ul>\n<li>Default configuration for search indexing</li>\n<li>Default configuration for faceting</li>\n</ul>\n</li>\n</ul>\n<p>[List came from <a href=\"https://islandora.ca/content/islandora-8-now-available\">link</a> <a href=\"https://www.islandora.ca/content/islandora-8-v110-now-available\">link</a>]</p>\n",
            "author": {
                "name": "Don Richards"
            },
            "tags": [
            ],
            "date_published": "2020-06-19T09:14:36-04:00",
            "date_modified": "2020-06-19T09:14:36-04:00"
        }
    ]
}
